app/controllers/posts_controller.rb

  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: params[:id]).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 17]]

  def create
    @post = Post.new(content: params[:content],user_id: @current_user.id)

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "完成！"], ["created_at", "2020-10-08 13:52:36.675489"], ["updated_at", "2020-10-08 13:52:36.675489"], ["user_id", 12]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "よろしく！！"], ["updated_at", "2020-10-20 07:21:23.083196"], ["id", 21]]

  def ensure_correct_user
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]