app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)  [["name", "田中"], ["email", "tanaka"], ["created_at", "2020-10-08 09:16:59.888463"], ["updated_at", "2020-10-08 09:16:59.888463"], ["image_name", "default_user.gif"], ["password", "tanaka"]]
---
  def create
    @user = User.new(name: params[:name], email: params[:email],image_name: "default_user.gif",password: params[:password])

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "3.jpg"], ["updated_at", "2020-10-05 12:25:34.345725"], ["id", 3]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}",image.read)
    end

    if @user.save

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 10]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def likes
    @likes = Like.where(user_id: params[:id])
    @user = User.find_by(id: params[:id])